Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: En aquests sistemes (vegeu l'apartat ), la informació necessària per a realitzar la traducció automàtica s'aprén automàticament de manera inductiva a partir d'un corpus paral·lel, és a dir, de grans quantitats de textos i les seues traduccions, prèviament segmentats i alineats per posar cada oració d'un text en correspondència amb la seua traducció en l'altre. Els sistemes basats en corpus més comuns són els de traducció automàtica estadística, on el que s'aprenen són models probabilístics de traducció.
es_es: En estos sistemas (véase el apartado ), la información necesaria para realizar la traducción automática se aprende automáticamente de manera inductiva a partir de un corpus paralelo, es decir, de grandes cantidades de textos y sus traducciones, previamente segmentados y alineados para poner cada oración de un texto en correspondencia con su traducción en el otro. Los sistemas basados en corpus más comunes son los de traducción automática estadística, donde lo que se aprenden son modelos probabilísticos de traducción.

source: En aquests sistemes interactius, cal tenir en compte dos factors: el primer, que un sistema que pregunta massa no és còmode d'usar (no és ergonòmic) i el segon, que pot passar que l'usuari siga monolingüe, circumstància que canvia molt la naturalesa de la interacció entre el programa i l'usuari.
es_es: En estos sistemas interactivos, hay que tener en cuenta dos factores: el primero, que un sistema que pregunta demasiado no es cómodo de usar (no es ergonómico) y el segundo, que puede pasar que el usuario sea monolingüe, circunstancia que cambia mucho la naturaleza de la interacción entre el programa y el usuario.

source: En aquests sistemes, la informació necessària per a realitzar la traducció automàtica (diccionaris, regles) l'han escrita persones expertes de manera deductiva: és a dir, han pensat en com automatitzar el procés de traducció automàtica i n'han deduït la informació necessària per a realitzar-la.
es_es: En estos sistemas, la información necesaria para realizar la traducción automática (diccionarios, reglas) la han escrito personas expertas de manera deductiva: es decir, han pensado en cómo automatizar el proceso de traducción automática y han deducido la información necesaria para realizarla.

source: En aquests sistemes, la representació abstracta (RALO) que s'obté en l'anàlisi inclou un arbre d'anàlisi sintàctica de la frase en LO (o una entitat equivalent), que descriu les relacions sintàctiques existents entre les parts de la frase, a més de la informació morfològica necessària per a fer-ne la traducció.
es_es: En estos sistemas, la representación abstracta (RALO) que se obtiene en el análisis incluye un árbol de análisis sintáctico de la frase en LO (o una entidad equivalente), que describe las relaciones sintácticas existentes entre las partes de la frase, además de la información morfológica necesaria para hacer la traducción.

source: En cada iteració el programa alineador visita totes les oracions paral·leles del corpus i va refinant aquestes probabilitats fins que l'estructura d'alineament queda definida.
es_es: En cada iteración el programa alineador visita todas las oraciones paralelas del corpus y va refinando estas probabilidades hasta que la estructura de alineamiento queda definida.

source: En cada una de les frases, la raó lingüística per la qual la segona traducció és incorrecta ha de ser diferent.
es_es: En cada una de las frases, la razón lingüística por la cual la segunda traducción es incorrecta tiene que ser diferente.

source: En canvi, en francés es parla, com en català o en espanyol, de { traduction automatique}.
es_es: En cambio, en francés se habla, como en catalán o en español, de { traduction automatique}.

source: En canvi, si el text original està en basc, les coses no són tan senzilles.
es_es: En cambio, si el texto original está en vasco, las cosas no son tan sencillas.

source: En català de Mallorca s'usa una estructura similar amb el verb defectiu nòmer: Jo nom Joan.
es_es: En catalán de Mallorca se usa una estructura similar con el verbo defectivo nòmer: Jo nom Joan.

source: En català també hi ha verbs ergatius com ara bullir (Jo bull la llet / La llet bull).
es_es: En catalán también hay verbos ergativos como por ejemplo bullir (Jo bull la llet / La llet bull).

source: En concret, i per posar un exemple, estudiem parells de mots gramaticalment vàlids on el primer mot apareix unes 400 vegades en total en el corpus i el segon mot hi apareix unes 200.
es_es: En concreto, y para poner un ejemplo, estudiamos pares de palabras gramaticalmente válidas donde la primera palabra aparece unas 400 veces en total en el corpus y la segunda palabra aparece unas 200.

source: En el cas d'{ angoixem}, el procés hauria estat idèntic fins a { angoixe-}: a n g o i x e m a n g o ixa - - r<verb><presind><1p><pl> r<verb><pressubj><1p><pl> r<verb><imp><1p><pl> En aquest cas, el mot té tres anàlisis morfològiques diferents.
es_es: En el caso de { angoixem}, el proceso habría sido idéntico hasta { angoixe-}: a n g o i x e m a n g o ixa - - r<verb><presind><1p><pl> r<verb><pressubj><1p><pl> r<verb><imp><1p><pl> En este caso, la palabra tiene tres análisis morfológicos diferentes.

source: En el cas de l'screening, fins i tot una traducció incompleta a més d'incorrecta (per exemple, només dels mots terminològics) pot ser de gran utilitat.
es_es: En el caso del screening, incluso una traducción incompleta además de incorrecta (por ejemplo, sólo de las palabras terminológicas) puede ser de gran utilidad.

source: En el cas general d'afegir una llengua a un conjunt de $N$ llengües, calen $2N$ nous mòduls de transferència.
es_es: En el caso general de añadir una lengua a un conjunto de $N$ lenguas, hacen falta $2N$ nuevos módulos de transferencia.

source: En el llenguatge controlat, es podria evitar el primer significat proposant els autors que feren servir el mot alternatiu { escondrijo}.
es_es: En el lenguaje controlado, se podría evitar el primer significado proponiendo a los autores que usaran la palabra alternativa { escondrijo}.

source: En el moment d'escriure aquestes línies (desembre de 2015), la major part dels sistemes de traducció automàtica es basen en una evolució de la traducció automàtica estadística iniciada en IBM durant la dècada dels 1990; se sol parlar de traducció automàtica estadística basada en frases, en anglés phrase-based statistical machine translation.
es_es: En el momento de escribir estas líneas (diciembre de 2015), la mayor parte de los sistemas de traducción automática se basan en una evolución de la traducción automática estadística iniciada en IBM durante la década de los 1990; se suele hablar de traducción automática estadística basada en frases, en inglés phrase-based statistical machine translation.

source: En els sistemes de transferència morfològica avançada ---també anomenats sistemes de transferència sintàctica parcial o transformers [4.2]{arnold94b}--- la fase d'anàlisi analitza morfològicament els mots de la frase i els desambigua en cas d'ambigüitat lèxica categorial però només identifica les relacions (sintàctiques) entre ells usant patrons molt senzills.) Reverso ({http://www.reverso.net}), i Apertium ({http://www.apertium.org}).} La secció dóna més detalls sobre els processos i els mètodes d'anàlisi i generació morfològiques.
es_es: En los sistemas de transferencia morfológica avanzada ---también llamados sistemas de transferencia sintáctica parcial o transformers [4.2]{arnold94b}--- la fase de análisis analiza morfológicamente las palabras de la frase y los desambigua en caso de ambigüedad léxica categorial, pero sólo identifica las relaciones (sintácticas) entre ellos usando patrones muy sencillos.) Reverso ({http://www.reverso.net}), y Apertium ({http://www.apertium.org}).} La sección da más detalles sobre los procesos y los métodos de análisis y generación morfológicas.

source: En els sistemes de traducció automàtica, la preedició... ... redueix la quantitat de postedició.
es_es: En los sistemas de traducción automática, la preedición... ... reduce la cantidad de postedición.

source: En els últims anys s'està investigant una nova modalitat de traducció basada en l'anomenat aprenentatge profund, en anglés deep learning, que usa mètodes d'un camp de la intel·ligència artificial anomenat xarxes neurals, i els resultats comencen a ser, en proves de laboratori, comparables als millors disponibles.
es_es: En los últimos años se está investigando una nueva modalidad de traducción basada en el llamado aprendizaje profundo, en inglés deep learning, que usa métodos de un campo de la inteligencia artificial denominado redes neurales, y los resultados empiezan a ser, en pruebas de laboratorio, comparables a los mejores disponibles.

source: En els últims anys, especialment des que s'ha generalitzat l'accés públic a Internet, s'observa una tendència a incorporar sistemes de traducció automàtica com un dels components de sistemes més grans de comunicació.
es_es: En los últimos años, especialmente desde que se ha generalizado el acceso público a Internet, se observa una tendencia a incorporar sistemas de traducción automática como uno de los componentes de sistemas más grandes de comunicación.

source: En general, aquestes operacions es poden considerar bàsicament independents del procés de traducció mateix ---com farem en aquest llibre---, però hi ha programes més avançats que són fins i tot capaços d'usar la informació de les etiquetes com a context per a elegir una traducció on hi ha més d'una alternativa.
es_es: En general, estas operaciones se pueden considerar básicamente independientes del proceso de traducción mismo ---como haremos en este libro---, pero hay programas más avanzados que son incluso capaces de usar la información de las etiquetas como contexto para elegir una traducción en la que hay más de una alternativa.

source: En general, per a $N$ llengües $L_1, L_2, , L_N$ hi hauria $N$ mòduls d'anàlisi, $N$ mòduls de generació i $N(N-1)$ mòduls de transferència.
es_es: En general, para $N$ lenguas $L_1, L_2, , L_N$ habría $N$ módulos de análisis, $N$ módulos de generación y $N(N-1)$ módulos de transferencia.

source: En informàtica teòrica, les màquines idealitzades que representen aquesta classe de GDA s'anomenen transductors d'estats finits $p$-subseqüencials sense cicles, on $p$ indica el nombre de possibles opcions en els estats finals.
es_es: En informática teórica, las máquinas idealizadas que representan esta clase de GDA se llaman transductores de estados finitos $p$-subsecuenciales sin ciclos, donde $p$ indica el número de opciones posibles en los estados finales.

source: En l'intent de representar els significats de totes les frases de totes les llengües, les interlingües clàssiques acabarien per ser ``models del món''.
es_es: En el intento de representar los significados de todas las frases de todas las lenguas, las interlinguas clásicas acabarían por ser ``modelos del mundo''.

source: En la RATO s'eliminen tots els detalls de la frase en LO que no es consideren rellevants per a la traducció i se'n destaquen aquelles característiques i relacions que sí que ho són.
es_es: En la RATO se eliminan todos los detalles de la frase en LO que no son relevantes para la traducción y se destacan aquellas características y relaciones que sí que lo son.

source: En la fase de transferència, s'apliquen regles de transferència estructural que transformen la representació sintàctica de la frase d'entrada (la RALO) en una representació sintàctica de la traducció (la RALM) usant regles de transformació d'estructures i de transferència lèxica que tradueixen els mots en LO a mots en LM usant un diccionari bilingüe.
es_es: En la fase de transferencia, se aplican reglas de transferencia estructural que transforman la representación sintáctica de la frase de entrada (la RALO) en una representación sintáctica de la traducción (la RALM) usando reglas de transformación de estructuras y de transferencia léxica que traducen las palabras en LO a palabras en LM usando un diccionario bilingüe.

source: En la figura anterior es pot veure una part de l'analitzador morfològic, corresponent als mots que comencen per ang-.
es_es: En la figura anterior se puede ver una parte del analizador morfológico, correspondiente a las palabras que empiezan por ang-.

source: En la frase catalana m'agraden els llimons, qui produeix el plaer, és a dir, l'agent, (els llimons) fa de subjecte en l'oració, mentre que en l'equivalent anglesa (I like lemons) hi fa d'objecte directe o en l'equivalent portugués (Eu gosto de limões) apareix com a complement preposicional; qui experimenta el plaer fa d'objecte en català i de subjecte en anglés i en portugués.
es_es: En la frase catalana m'agraden els llimons, quien produce el placer, es decir, el agente, (els llimons) hace de sujeto en la oración, mientras que en la equivalente inglesa (I like lemons) hace de objeto directo o en el equivalente portugués (Eu gosto de limõse) aparece como complemento preposicional; quien experimenta el placer hace de objeto en catalán y de sujeto en inglés y en portugués.

source: En la gramàtica de la llengua, si una regla que estén un sintagma es pot aplicar repetidament a un determinat tipus de sintagma, aquest sintagma es pot allargar indefinidament.
es_es: En la gramática de la lengua, si una regla que extiende un sintagma se puede aplicar repetidamente en un determinado tipo de sintagma, éste se puede alargar indefinidamente.

source: En la taula, el símbol $$ indica tant el principi com el final de l'oració (l'anàlisi d'una oració comença empilant $$ en la pila).
es_es: .En la tabla, el símbolo $$ indica tanto el principio como el final de la oración (el análisis de una oración comienza apilando $$ en la pila).

source: En particular, es parla d'interlingua quan la representació interna que s'obté de l'anàlisi és independent de quines siguen la LO i la LM, és a dir, la interlingua és { lingüísticament neutral}.
es_es: En particular, se habla de interlingua cuando la representación interna que se obtiene del análisis es independiente de cuáles sean la LO y la LM, es decir, la interlingua es { lingüísticamente neutral}.

source: En primera aproximació, la postedició serà convenient quan $$cost({ctraducció automàtica
es_es: En primera aproximación, la postedición será conveniente cuando $$coste({ctraducción automática

source: En quin dels tres mòduls d'un sistema de traducció automàtica indirecta per transferència es fan els reordenaments dels mots de la llengua original perquè l'ordre siga l'adequat en la llengua meta?
es_es: ¿En cuál de los tres módulos de un sistema de traducción automática indirecta por transferencia se hacen los reordenamientos de las palabras de la lengua original para que el orden sea el adecuado en la lengua meta?

source: En quin tipus de sistema de traducció automàtica tindrien bàsicament la mateixa representació les frases David és vist per Lluc i Lluc veu David?
es_es: ¿En qué tipo de sistema de traducción automática tendrían básicamente la misma representación las frases David és vist per Lluc y Lluc veu David?

source: En quina de les tres fases d'un sistema de transferència s'usen els diccionaris bilingües?
es_es: ¿En cuál de las tres fases de un sistema de transferencia se usan los diccionarios bilingües?

source: En quina de les tres situacions següents es troba?
es_es: ¿En cuál de las tres situaciones siguientes se encuentra?

source: En quins casos es ``trenquen'' sintagmes?
es_es: ¿En qué casos se ``rompen" sintagmas?

source: En resum, hi ha tres modalitats bàsiques d'interacció entre les persones i els programes de traducció automàtica: la preedició (preparació del text abans de la traducció automàtica), la postedició (correcció del text després de la traducció automàtica) i la interacció de la persona amb el sistema de traducció automàtica durant el procés de traducció.
es_es: En resumen, hay tres modalidades básicas de interacción entre las personas y los programas de traducción automática: la preedición (preparación del texto antes de la traducción automática), la postedición (corrección del texto después de la traducción automática) y la interacción de la persona con el sistema de traducción automática durante el proceso de traducción.

source: En resum, la distribució no és gens homogènia: uns pocs mots són els més freqüents i la majoria són moltíssim menys freqüents.
es_es: En resumen, la distribución no es nada homogénea: unas pocas palabras son las más frecuentes y la mayoría son muchísimo menos frecuentes.

source: En una oferta de treball, WorldTrans demana experts en suahili però no demana cap expert en traducció entre suahili i cap de les quinze llengües.
es_es: En una oferta de trabajo, WorldTrans pide expertos en swahili, pero no pide ningún experto en traducción entre swahili y ninguna de las quince lenguas.

source: Encara pot ser nom o verb.
es_es: Todavía puede ser nombre o verbo.

source: Encara resta molt a fer amb les altres llengües del món; amb excepcions com ara el projecte Apertium ({http://www.apertium.org}), que ofereix traducció automàtica per a llengües menys centrals, com ara el gallec, l'occità, el bretó.
es_es: Todavía queda mucho por hacer con las otras lenguas del mundo; con excepciones como el proyecto Apertium ({http://www.apertium.org}), que ofrece traducción automática para lenguas menos centrales, como por ejemplo el gallego, el occitano, el bretón.

source: Ens ajuda conéixer quins són els mots homògrafs (vegeu la p. ) més comuns de la llengua origen?
es_es: ¿Nos ayuda conocer cuáles son las palabras homógrafas (véase la p. ) más comunes de la lengua origen?

source: Ens els darrers 10 anys, un dels camps amb més investigacions ha estat el de traducció de la parla, una idea que evidentment ha estat present des de fa dècades, però que només ara es pot materialitzar parcialment.
es_es: En los últimos 10 años, uno de los campos con más investigaciones ha sido el de traducción del habla, una idea que evidentemente ha estado presente desde hace décadas, pero que sólo ahora se puede materializar parcialmente.

source: Entrada restant
es_es: Entrada restante

source: Entre aquests sistemes, podem distingir: Els sistemes de traducció automàtica indirecta per transferència (apartat ), entre els quals, podem distingir, d'acord amb el nivell d'abstracció lingüística: els sistemes de transferència morfològica avançada (de vegades anomenats de ``traducció directa'', tot i que no ho són; apartat ); els sistemes de transferència sintàctica (apartat ), i els sistemes de transferència semàntica (apartat ).
es_es: Entre estos sistemas, podemos distinguir: Los sistemas de traducción automática indirecta por transferencia (apartado ), entre los cuales, podemos distinguir, de acuerdo con el nivel de abstracción lingüística: los sistemas de transferencia morfológica avanzada (a veces denominados de ``traducción directa'', a pesar de que no lo son; apartado ); los sistemas de transferencia sintáctica (apartado ), y los sistemas de transferencia semántica (apartado ).

source: Entre els tipus de sistemes de traducció automàtica indirectes, el primer que comença a aplicar, almenys parcialment, el principi de composicionalitat és el de transferència sintàctica, ja que construeix la traducció usant com a pas intermedi un arbre d'anàlisi sintàctica de l'oració original.
es_es: Entre los tipos de sistemas de traducción automática indirectas, el primero que empieza a aplicar, al menos parcialmente, el principio de composicionalidad es el de transferencia sintáctica, puesto que construye la traducción usando como paso intermedio un árbol de análisis sintáctico de la oración original.

source: Es poden dir encara més coses sobre la traducció: les traduccions solen estar escrites en un subllenguatge particular (registre, especialitat, etc.) de la comunitat lingüística de la LM, basat en un subllenguatge paral·lel de la LO; els documents i les traduccions corresponents es poden classificar en tipus i aquesta tipologia afecta la traducció; la traducció es veu afectada per elements extralingüístics perquè, normalment, els documents són entitats que uneixen l'expressió lingüística amb l'expressió no lingüística; les traduccions tenen un receptor o lector; una traducció, com a acte comunicatiu ha de considerar, a més de la intenció de la traducció, les expectatives dels lectors, que resulten del seu rerefons cultural i de les seues necessitats comunicatives, i que influeixen en la recepció del text traduït; la traducció sempre té una motivació: la superació de barreres comunicatives; per això se n'ha creat una professió.
es_es: Se pueden decir todavía más cosas sobre la traducción: las traducciones suelen estar escritas en un sublenguaje particular (registro, especialidad, etc.) de la comunidad lingüística de la LM, basado en un sublenguaje paralelo de la LO; los documentos y las traducciones correspondientes se pueden clasificar en tipos y esta tipología afecta a la traducción; la traducción se ve afectada por elementos extralingüísticos porque, normalmente, los documentos son entidades que unen la expresión lingüística con la no lingüística; las traducciones tienen un receptor o lector; una traducción, como acto comunicativo tiene que ser considerado, además de la intención de la traducción, las expectativas de los lectores, que resultan de su transfondo cultural y de sus necesidades comunicativas, y que influyen en la recepción del texto traducido; la traducción siempre tiene una motivación: la superación de barreras comunicativas; por ello, se ha creado una profesión.

source: Es pot aprofundir un poc més en la definició de traducció que hem considerat més amunt, revisant definicions existents (algunes preses de {sager93b}): [p. 19]{nida59b}: ``La traducció consisteix a produir en la llengua meta l'equivalent natural més proper del missatge en la llengua origen, primerament quant al significat i segonament quant a l'estil.'' Sager diu que, més que natural (en sentit absolut) caldria dir adequat (a la tasca concreta).
es_es: Se puede profundizar un poco más en la definición de traducción que hemos considerado más arriba, revisando definiciones existentes (algunas extraídas de {sager93b}): [p. 19]{nida59b}: ``La traducción consiste en producir en la lengua meta el equivalente natural más cercano del mensaje en la lengua origen, primeramente en cuanto al significado y en segundo lugar en cuanto al estilo.'' Sager dice que, más que natural (en sentido absoluto) habría que decir adecuado (a la tarea concreta).

source: Es pot demostrar que, a pesar de ser menys freqüents, ``precio máximo'' o ``algunos sectores'' també tendeixen a estar junts per damunt de l'atzar, pot ser per ser col·locacions pròpies del tema econòmic.
es_es: Se puede demostrar que, a pesar de ser menos frecuentes, ``precio máximo'' o ``algunos sectores'' también tienden a estar juntos por encima del azar, puede ser porque son colocaciones propias del tema económico.

source: Es pot posteditar sense mirar el text original?
es_es: ¿Se puede posteditar sin mirar el texto original?

source: Es tracta bàsicament d'un sistema per transferència, indicat per a la traducció de documents relacionats amb el processament de dades i les telecomunicacions.
es_es: Se trata básicamente de un sistema por transferencia, indicado para la traducción de documentos relacionados con el procesamiento de datos y las telecomunicaciones.
